[CLS]
[SEP]
[MASK]
[PAD]
[UNK]
,
(
)
<imm>
<label>
%rax
mov
%eax
%rbp
%rdi
%rip
%rsp
%edx
%rdx
movzbl
%rbx
movq
callq
lea
%rcx
movl
%rsi
%ecx
%al
je
%r12
<end>
victim_function
jmpq
temp
movb
test
add
cmp
%r13
%esi
pop
cmpq
jne
-8
%r14
movslq
xor
%r15
push
%dl
pushq
%edi
addq
ret
array1_size
retq
-16
@function
%r8
array2
nopl
victim_function:
sub
jmp
leaq
%xmm0
array1
%r9
andl
%r8d
<UNK>
%ebx
jae
andb
%r10
%r11
%xmm1
nop
shlq
nopw
 -16
popq
subq
%ebp
%r9d
4
%r12d
jbe
sall
%r13d
%sil
cltq
%r14d
cmpl
%cl
 8
cmpb
%r15d
%xmm2
%r10d
%ax
xorl
leave
%r11d
-24
%xmm3
%xmm4
shr
movss
and
subl
movaps
%xmm5
movsd
shl
jnb
shll
%dil
movdqa
%xmm6
testq

%xmm7
or
sar
xchg
%bl
jle
imul
incq
imull
:
ja
%fs
js
addl
-40
movapd
%xmm8
%esp
%r8b
%xmm9
testl
subb
%xmm10
sete
andq
*
%xmm11
testb
movzwl
%xmm12
%xmm13
jg
xorq
%xmm15
orl
%xmm14
seta
call
%r9b
%r15b
sbbl
%r12b
%r13b
%r10b
%r14b
%r11b
rol
cmova
not
salq
-48
movd
addpd
xorb
cmovbe
ror
cmovle
cmovl
prefetcht0
sfence
prefetcht1
setae
cmovbq
testw
15
cmovll
pxor
addb
leal
jb
cmovaeq
orq
%bpl
sbbq
notq
rep ret
sarq
sal
mulsd
jl
mul
repz
%spl
mulss
movabs
lock
vmovsd
decq
addsd
movups
mfence
jns
lfence
leakByteNoinlineFunction:
16
movdqu
@object
addss
%dx
subsd
-56
12288
vmovdqa
jge
2
leakByteLocalFunction:
cmpsb
movswl
%ymm0
vmulsd
paddd
-12
vmovups
%cx
vmovss
neg
movsbl
setb
%si
setne
%ymm1
leaveq
cmove
ucomisd
sbb
vzeroupper
vaddsd
cmovb
vpxor
vmovdqu
vmovaps
%ymm2
%r8w
cvtsi2sd
vpaddd
subss
paddw
%r9w
%ymm3
%bp
%ymm4
%st
%bx
cmovne
%r12w
%r13w
adc
%r10w
%r15w
%r11w
xadd
punpcklwd
bswap
%r14w
%ymm5
divsd
%ymm6
addps
mulps
pand
%ymm7
psrad
%mm0
negl
pmaddwd
cmovg
%sp
rep
cvttsd2si
psubw
subps
punpckhwd
ucomiss
%mm1
vsubsd
cltd
array3
vxorpd
cmpw
%mm2
por
vmulss
%fs:
%ymm8
%ah
idiv
vextractf128
%mm6
div
%mm3
vinserti128
punpcklbw
victim_function_v13
%ymm9
%mm4
vaddss
stos
%ymm10
jnp
pshufd
vpaddw
%mm5
%di
vpmaddwd
jp
cmovs
%mm7
punpckldq
%ymm11
movhps
shufps
xorps
vpsrad
%ymm14
movsbq
%ymm12
cvtss2sd
%ymm13
%ymm15
vmovq
andpd
movhpd
paddq
vmovapd
psubd
vxorps
cvtsi2ss
mulpd
vinsertf128
vpaddq
setg
psraw
punpcklqdq
vpor
vcvtss2sd
vpsubw
divss
packuswb
mulq
vpand
movswq
pslld
vsubss
movabsq
cmovns
psrld
packssdw
vpsrld
punpckhdq
cvtsi2sdl
punpckhbw
psrldq
fldt
vpslld
vmovd
xorpd
psrlq
inc
pandn
bt
vmovdqu32
131072
vpsrlq
fstpt
%dh
vmovupd
dec
setbe
vpunpcklwd
vextracti128
cvtsd2ss
vcomisd
pshufb
movlps
cmovge
cqto
vmulpd
pmuludq
vdivsd
psrlw
pushl
cmovae
vpunpckldq
vpinsrq
vpmaddubsw
vcvtsi2sd
andps
orb
vpunpckhwd
vpshufb
vpackssdw
cvttss2si
paddsw
punpckhqdq
%ch
vpmovzxbw
pmullw
psllw
%bh
vcvtsd2ss
fstp
vaddpd
vpermq
psubusb
vpsubd
vpunpcklqdq
psllq
vpunpckhdq
pmaxsw
pcmpgtd
fldl
%zmm16
pmaddubsw
bsr
vpsllq
unpcklps
setle
fxch
pavgb
 %ecx
movsq
fstpl
movw
vpackuswb
movlpd
sqrtsd
vpandn
vpsrldq
pmulld
vpsraw
rorx
pshuflw
vcvtsi2ss
vpmuludq
pminsw
vlddqu
fmul
%zmm17
divq
vpshufd
pinsrq
pcmpgtw
phaddd
pmulhrsw
psadbw
vpmulhrsw
vpunpcklbw
psubsw
setl
shrd
idivl
vpmulld
movsb
unpckhps
scas
sqrtss
repnz
vpbroadcastd
pcmpeqw
unpcklpd
orpd
vminsd
comisd
vcvttsd2si
%zmm18
subpd
cvtsi2sdq
vpunpckhqdq
paddb
aesenc
pabsw
andnpd
pcmpgtb
vpabsw
pmulhw
minss
vpsrlw
maxsd
psubusw
vpaddsw
vpinsrd
pavgw
cmpxchg
decl
comiss
vpunpckhbw
maxss
ud2
vpaddusw
%zmm19
movhlps
vcomiss
vsubpd
pcmpeqb
paddusw
movupd
pcmpeqd
aesdec
pslldq
vaddps
minsd
vmulps
%zmm20
%es:
cwtl
psubb
flds
vperm2i128
cvtsi2ssl
vperm2f128
vdivss
fld
tzcnt
%ds:
pmovzxbw
addw
paddusb
faddp
vmpsadbw
vpsubsw
cmpnlesd
movlhps
vpsubusb
setnp
vshufps
vsubps
palignr
vpinsrb
setp
vsqrtsd
setge
vpbroadcastw
vpalignr
kmovw
incl
pminsd
movsbw
pmaxsd
vandpd
pshufhw
vpsllw
vcvtsi2sdl
orw
pextrw
syscall
cpuid
vpsubq
psignw
vcvttss2si
divl
vpmaxsw
vcvtdq2pd
%zmm1
vfmadd213pd
vpminsw
pmovzxwd
vmovdqa32
cld
vpmovsxdq
faddl
%zmm0
vpavgb
packsswb
fldz
out
idivq
vpextrb
vpextrd
vpsadbw
vphaddd
fstl
fstps
fmulp
vshufpd
vpcmpeqw
vucomiss
vpmovsxwd
cvtpd2ps
movntdqa
movzbq
divpd
vandps
%zmm21
bndmov
pmulhuw
fldcw
vunpcklpd
%bnd2
adcx
movsl
phaddw
%zmm2
fld1
pshufw
vucomisd
vaesenc
%zmm24
vmaxsd
vpcmpgtw
vpsubusw
vmovhpd
mulx
vpinsrw
cvtdq2ps
vpmovzxwd
cvtps2pd
%zmm5
vpshuflw
orps
vmovddup
in
fsubl
%zmm3
pminub
vpsubb
pmovzxbd
emms
vmovhps
%zmm22
cvtdq2pd
vpavgw
subw
adox
vblendpd
%zmm23
pmaxub
%zmm9
vpextrw
andnps
%zmm4
andw
vfmadd213ps
unpckhpd
vpcmpgtb
vsqrtss
%zmm11
%zmm6
fmull
vcvtsi2ssl
vextracti32x8
shld
fadd
paddsb
vmaxss
sha256rnds2
fadds
prefetchnta
fsubrp
%zmm10
vpaddb
rorl
vpmovzxbd
sarl
cvtsi2ssq
andn
%ymm16
fnstsw
fsubp
vpblendd
%zmm7
movntq
vpackusdw
vpcmpeqb
fsub
%zmm13
fmuls
fchs
%zmm12
%zmm8
vpcmpeqd
vbroadcastss
vpabsd
vpslldq
%zmm14
cmpxchg16b
pabsd
fcomi
roll
vpaddusb
vpmulhw
vpsllvq
%gs
vbroadcasti128
fucomi
vminss
%xmm16
mpsadbw
fildl
%zmm15
int
vpxord
%zmm25
fildll
shlx
bts
%zmm26
vpmullw
fucomip
vpbroadcastq
pmovmskb
%zmm27
%zmm28
%zmm29
lddqu
sahf
psubq
jo
pinsrw
vinserti32x8
bndstx
%zmm30
bsf
lockcmpxchg
pextrd
cmpnless
%zmm31
cvtps2dq
aesenclast
minps
fcomip
%k7
%k4
%k5
%k6
vbroadcastsd
vcvtss2si
vpacksswb
vpermilpd
shrl
vpsrlvq
maxps
fsts
fnstcw
6
packusdw
vpmovsxbw
fdivp
psubsb
vdivpd
vpmovmskb
rolw
vpermd
prefetcht2
vunpcklps
shufpd
aesdeclast
vpcmpgtd
vpmovzxdq
incw
pmovzxdq
vaesdec
divps
stmxcsr
pause
shrq
vextractps
rdtsc
pavgusb
vpandq
vcvtsi2sdq
pmovsxwd
vpcmpeqq
vpsignw
cmpunordsd
aeskeygenassist
vpbroadcastb
vfnmadd231ps
notb
fdiv
outsl
fdivrp
pmovsxdq
cmpltsd
popcnt
vmovdqa64
vfnmadd231pd
vorpd
sha1rnds4
sha1nexte
vprold
vpmuldq
fistpl
vunpckhps
movmskps
vpmovqd
fsubr
vpmaxuw
vphminposuw
pblendw
vpgatherdd
fabs
notl
vpminub
bndldx
lret
aesimc
vpblendvb
fxam
movq2dq
bnd
vphaddw
insb
vandnpd
addr32
%bnd3
%k0
vpternlogq
%k1
vpaddsb
vcvttpd2dqy
vpclmullqlqdq
sha1msg1
sha1msg2
pextrb
vpmulhuw
%bnd0
cmpleps
fsubrl
vcvtdq2ps
pextrq
vcvtps2pd
vpmaxub
vpshufhw
sha256msg1
sha256msg2
bndcu
kxnorw
shlb
vpmadd52luq
vpmadd52huq
vprotd
pmuldq
movzwq
cmpltss
lods
%ymm17
%k3
bndcl
vgatherdpd
cmplesd
outsb
%ymm18
filds
cmpnltps
vpxorq
vmovhlps
%ymm19
vpandd
vpmaxsd
vunpckhpd
fistpll
ss
fcmovb
vmovlhps
vhaddpd
vmovlpd
fsqrt
insl
pabsb
cmpneqpd
pushfq
hlt
shlw
%ymm23
movntdq
fprem
fwait
fucom
lockxadd
fistl
vaesenclast
vshufi32x4
btr
%ymm20
%xmm17
pclmullqlqdq
vroundss
shrx
xgetbv
popfq
negq
int3
vpclmulhqhqdq
cvttps2dq
vptestmd
vmovdqu64
vcvtsd2si
fcmovnbe
%ymm22
vcvtpd2ps
fucompp
vptest
vroundsd
fdivr
sti
jno
vcvtps2dq
vcmpnltps
%ymm21
vpsignd
vpextrq
cmpnltsd
cmpsl
icebp
cmpltps
fldenv
cvtsd2si
shrb
sqrtps
vpandnq
vfmsub213pd
vgatherqpd
%k2
movmskpd
cli
fnstenv
rex
mull
rsqrtps
movddup
vfmadd231pd
xlat
vblendps
pminud
vprotq
vcmpltps
movdq2q
sarw
enterq
fsubrs
std
vpclmullqhqdq
vpblendw
vpabsb
shrw
vmovmskps
vpandnd
vpsubsb
adcl
mulb
vandnps
gs
vextracti32x4
%xmm20
pclmulhqhqdq
vfnmadd132pd
vfnmadd132ps
movzbw
rcpps
phminposuw
fdivl
stc
jrcxz
iret
%xmm21
lahf
vextracti64x4
pminuw
cmpless
cmc
%ymm28
vcmpnle_uqpd
vcvtpd2psy
fsubs
%ymm30
vorps
%ymm27
xabort
vpermilps
kmovq
clc
ds
%ymm25
%ymm26
pushf
vporq
cvtss2si
vbroadcastf128
%xmm24
vmaskmovpd
%cs:
psignd
ldmxcsr
fucomp
vfmadd231ps
vpcmpneqb
haddps
cs
vcvtsi2ssq
fdivrl
vfmadd132ps
vpminsd
fdivrs
loope
movbe
vzeroall
vcmpltsd
pblendvb
cmovp
popf
vcmpgt_oqpd
vfmadd132pd
vrndscalepd
vfnmadd213pd
vcmpnle_uqps
vpternlogd
vfnmadd213ps
cmpordsd
rolq
cvttpd2dq
vinserti32x4
vminpd
vmaxpd
es
loop
vmovlps
addsubps
rcl
%ymm24
vpgatherqq
sqrtpd
negw
vpcmpnltd
fs
pinsrd
fdivs
%cs
sets
vpminuw
rsqrtss
vcmplesd
rolb
pclmullqhqdq
xrstor
bndmk
cmpnlepd
vmovmskpd
vptestmq
vcmple_oqpd
vcmpunordpd
cmpltpd
roundpd
vcmpnlt_uqpd
vpcmpltd
vpermps
vshuff32x4
cmpordss
vcmpltss
%xmm18
cmpneqps
%xmm22
rdrand
vmaskmovps
vpgatherdq
imulb
incb
vdivps
vcvttpd2dq
negb
vrsqrtss
fisubl
f
xend
vrcpps
vroundpd
vrcp28pd
vrcp14pd
cmpnleps
vcmple_oqps
cmpunordss
cwtd
cbtw
pfmul
lcall
rclb
vaesdeclast
%ymm29
fstenv
p
rorb
vcmpneq_oqsd
fcmove
rorw
pmovsxbw
vcmpltpd
%xmm23
vbroadcasti64x2
pmovsxbd
%es
fcomp
fstcw
phaddsw
vpsignb
vbroadcasti32x4
%ymm31
fiadds
fimull
decw
cmovnp
btc
vphaddwq
lretq
maxpd
xorw
fcmovnu
sarb
fcmovnb
vpclmulhqlqdq
fsincos
vpmovsxbd
lzcnt
phsubw
adcb
fnclex
xtest
%zmm2{%k1}{z}
%zmm13{%k1}{z}
vcmplt_oqpd
%zmm12{%k1}{z}
%zmm1{%k1}{z}
{rn-sae}
vpcmpled
vpord
vextractf32x8
seto
pminsb
pclmulhqlqdq
vphadddq
fnsave
vpcmpgtq
femms
gsjp
rcr
vphaddsw
s
rcrl
vcmpnlesd
vaddsubps
divb
pext
fcomps
fistps
movsw
fldl2e
pf2id
cvtps2pi
%ss:
fidivl
ljmp
fneni
%k4}{z}
rcll
fiaddl
sldt
xsha1
xsha256
xcrypt-cbc
xcrypt-cfb
xcrypt-ofb
notw
cmpnltss
lockor
lockadd
fscale
vpperm
%xmm19
fcompl
vinsertps
%ds
gsjb
clflush
cmpeqpd
fldln2
fcoms
fisubrs
decb
for
fcmovu
phsubd
pswapd
fcoml
ficomps
vpmaxsb
cmovno
xsave
%zmm6{%k1}{z}
%zmm7{%k2}{z}
%zmm5{%k1}{z}
%zmm3{%k1}{z}
%zmm1{%k2}{z}
%zmm4{%k3}{z}
%zmm13{%k3}{z}
%zmm8{%k2}{z}
%zmm7{%k1}{z}
%zmm14{%k2}{z}
%zmm11{%k3}{z}
%zmm10{%k1}{z}
vinsertf32x8
fpatan
psignb
setns
vshufi64x2
outsw
fsin
vpminud
vmovntdq
cmpeqps
idivb
rcrb
frstor
vcmpnltsd
fisttpl
pusha
popa
cmplepd
btsl
vinserti64x4
vextracti64x2
block
nsform
frndint
f2xm1
lsl
rdpid
fidivs
vmread
lgs
divw
hsubps
sbbb
ficoms
fisubrl
ficoml
fisttps
%k5}
fsja
esjs
fimuls
vcmpunordsd
vcmpnltss
pfadd
pfsub
ljmpw
fisttpll
insertps
abso
rb
pinsrb
vcmpeq_ussd
kmovd
vmovdqu8
vmovshdup
kmovb
bzhi
%ymm16{%k7}{z}
%ymm3{%k7}{z}
%ymm4{%k7}{z}
%ymm5{%k7}{z}
%ymm5{%k1}{z}
%ymm16{%k1}{z}
%ymm3{%k1}{z}
%ymm4{%k1}{z}
%xmm28
%xmm29
pmaxuw
vcmpneq_oqss
vsqrtpd
rcpss
vcvttps2dq
movshdup
vcmpleps
fcos
minpd
mburg
fidivrs
ficompl
fbstp
rdseed
sarx