{",": 0, "(": 1, ")": 2, "<imm>": 3, "<label>": 4, "%rax": 5, "mov": 6, "%eax": 7, "%rbp": 8, "%rdi": 9, "%rip": 10, "%rsp": 11, "%edx": 12, "%rdx": 13, "movzbl": 14, "%rbx": 15, "movq": 16, "callq": 17, "lea": 18, "%rcx": 19, "movl": 20, "%rsi": 21, "%ecx": 22, "%al": 23, "je": 24, "%r12": 25, "<end>": 26, "victim_function": 27, "jmpq": 28, "temp": 29, "movb": 30, "test": 31, "add": 32, "cmp": 33, "%r13": 34, "%esi": 35, "pop": 36, "cmpq": 37, "jne": 38, "-8": 39, "%r14": 40, "movslq": 41, "xor": 42, "%r15": 43, "push": 44, "%dl": 45, "pushq": 46, "%edi": 47, "addq": 48, "ret": 49, "array1_size": 50, "retq": 51, "-16": 52, "@function": 53, "%r8": 54, "array2": 55, "nopl": 56, "victim_function:": 57, "sub": 58, "jmp": 59, "leaq": 60, "%xmm0": 61, "array1": 62, "%r9": 63, "andl": 64, "%r8d": 65, "<UNK>": 66, "%ebx": 67, "jae": 68, "andb": 69, "%r10": 70, "%r11": 71, "%xmm1": 72, "nop": 73, "shlq": 74, "nopw": 75, " -16": 76, "popq": 77, "subq": 78, "%ebp": 79, "%r9d": 80, "4": 81, "%r12d": 82, "jbe": 83, "sall": 84, "%r13d": 85, "%sil": 86, "cltq": 87, "%r14d": 88, "cmpl": 89, "%cl": 90, " 8": 91, "cmpb": 92, "%r15d": 93, "%xmm2": 94, "%r10d": 95, "%ax": 96, "xorl": 97, "leave": 98, "%r11d": 99, "-24": 100, "%xmm3": 101, "%xmm4": 102, "shr": 103, "movss": 104, "and": 105, "subl": 106, "movaps": 107, "%xmm5": 108, "movsd": 109, "shl": 110, "jnb": 111, "shll": 112, "%dil": 113, "movdqa": 114, "%xmm6": 115, "testq": 116, "": 117, "%xmm7": 118, "or": 119, "sar": 120, "xchg": 121, "%bl": 122, "jle": 123, "imul": 124, "incq": 125, "imull": 126, ":": 127, "ja": 128, "%fs": 129, "js": 130, "addl": 131, "-40": 132, "movapd": 133, "%xmm8": 134, "%esp": 135, "%r8b": 136, "%xmm9": 137, "testl": 138, "subb": 139, "%xmm10": 140, "sete": 141, "andq": 142, "*": 143, "%xmm11": 144, "testb": 145, "movzwl": 146, "%xmm12": 147, "%xmm13": 148, "jg": 149, "xorq": 150, "%xmm15": 151, "orl": 152, "%xmm14": 153, "seta": 154, "call": 155, "%r9b": 156, "%r15b": 157, "sbbl": 158, "%r12b": 159, "%r13b": 160, "%r10b": 161, "%r14b": 162, "%r11b": 163, "rol": 164, "cmova": 165, "not": 166, "salq": 167, "-48": 168, "movd": 169, "addpd": 170, "xorb": 171, "cmovbe": 172, "ror": 173, "cmovle": 174, "cmovl": 175, "prefetcht0": 176, "sfence": 177, "prefetcht1": 178, "setae": 179, "cmovbq": 180, "testw": 181, "15": 182, "cmovll": 183, "pxor": 184, "addb": 185, "leal": 186, "jb": 187, "cmovaeq": 188, "orq": 189, "%bpl": 190, "sbbq": 191, "notq": 192, "rep ret": 193, "sarq": 194, "sal": 195, "mulsd": 196, "jl": 197, "mul": 198, "repz": 199, "%spl": 200, "mulss": 201, "movabs": 202, "lock": 203, "vmovsd": 204, "decq": 205, "addsd": 206, "movups": 207, "mfence": 208, "jns": 209, "lfence": 210, "leakByteNoinlineFunction:": 211, "16": 212, "movdqu": 213, "@object": 214, "addss": 215, "%dx": 216, "subsd": 217, "-56": 218, "12288": 219, "vmovdqa": 220, "jge": 221, "2": 222, "leakByteLocalFunction:": 223, "cmpsb": 224, "movswl": 225, "%ymm0": 226, "vmulsd": 227, "paddd": 228, "-12": 229, "vmovups": 230, "%cx": 231, "vmovss": 232, "neg": 233, "movsbl": 234, "setb": 235, "%si": 236, "setne": 237, "%ymm1": 238, "leaveq": 239, "cmove": 240, "ucomisd": 241, "sbb": 242, "vzeroupper": 243, "vaddsd": 244, "cmovb": 245, "vpxor": 246, "vmovdqu": 247, "vmovaps": 248, "%ymm2": 249, "%r8w": 250, "cvtsi2sd": 251, "vpaddd": 252, "subss": 253, "paddw": 254, "%r9w": 255, "%ymm3": 256, "%bp": 257, "%ymm4": 258, "%st": 259, "%bx": 260, "cmovne": 261, "%r12w": 262, "%r13w": 263, "adc": 264, "%r10w": 265, "%r15w": 266, "%r11w": 267, "xadd": 268, "punpcklwd": 269, "bswap": 270, "%r14w": 271, "%ymm5": 272, "divsd": 273, "%ymm6": 274, "addps": 275, "mulps": 276, "pand": 277, "%ymm7": 278, "psrad": 279, "%mm0": 280, "negl": 281, "pmaddwd": 282, "cmovg": 283, "%sp": 284, "rep": 285, "cvttsd2si": 286, "psubw": 287, "subps": 288, "punpckhwd": 289, "ucomiss": 290, "%mm1": 291, "vsubsd": 292, "cltd": 293, "array3": 294, "vxorpd": 295, "cmpw": 296, "%mm2": 297, "por": 298, "vmulss": 299, "%fs:": 300, "%ymm8": 301, "%ah": 302, "idiv": 303, "vextractf128": 304, "%mm6": 305, "div": 306, "%mm3": 307, "vinserti128": 308, "punpcklbw": 309, "victim_function_v13": 310, "%ymm9": 311, "%mm4": 312, "vaddss": 313, "stos": 314, "%ymm10": 315, "jnp": 316, "pshufd": 317, "vpaddw": 318, "%mm5": 319, "%di": 320, "vpmaddwd": 321, "jp": 322, "cmovs": 323, "%mm7": 324, "punpckldq": 325, "%ymm11": 326, "movhps": 327, "shufps": 328, "xorps": 329, "vpsrad": 330, "%ymm14": 331, "movsbq": 332, "%ymm12": 333, "cvtss2sd": 334, "%ymm13": 335, "%ymm15": 336, "vmovq": 337, "andpd": 338, "movhpd": 339, "paddq": 340, "vmovapd": 341, "psubd": 342, "vxorps": 343, "cvtsi2ss": 344, "mulpd": 345, "vinsertf128": 346, "vpaddq": 347, "setg": 348, "psraw": 349, "punpcklqdq": 350, "vpor": 351, "vcvtss2sd": 352, "vpsubw": 353, "divss": 354, "packuswb": 355, "mulq": 356, "vpand": 357, "movswq": 358, "pslld": 359, "vsubss": 360, "movabsq": 361, "cmovns": 362, "psrld": 363, "packssdw": 364, "vpsrld": 365, "punpckhdq": 366, "cvtsi2sdl": 367, "punpckhbw": 368, "psrldq": 369, "fldt": 370, "vpslld": 371, "vmovd": 372, "xorpd": 373, "psrlq": 374, "inc": 375, "pandn": 376, "bt": 377, "vmovdqu32": 378, "131072": 379, "vpsrlq": 380, "fstpt": 381, "%dh": 382, "vmovupd": 383, "dec": 384, "setbe": 385, "vpunpcklwd": 386, "vextracti128": 387, "cvtsd2ss": 388, "vcomisd": 389, "pshufb": 390, "movlps": 391, "cmovge": 392, "cqto": 393, "vmulpd": 394, "pmuludq": 395, "vdivsd": 396, "psrlw": 397, "pushl": 398, "cmovae": 399, "vpunpckldq": 400, "vpinsrq": 401, "vpmaddubsw": 402, "vcvtsi2sd": 403, "andps": 404, "orb": 405, "vpunpckhwd": 406, "vpshufb": 407, "vpackssdw": 408, "cvttss2si": 409, "paddsw": 410, "punpckhqdq": 411, "%ch": 412, "vpmovzxbw": 413, "pmullw": 414, "psllw": 415, "%bh": 416, "vcvtsd2ss": 417, "fstp": 418, "vaddpd": 419, "vpermq": 420, "psubusb": 421, "vpsubd": 422, "vpunpcklqdq": 423, "psllq": 424, "vpunpckhdq": 425, "pmaxsw": 426, "pcmpgtd": 427, "fldl": 428, "%zmm16": 429, "pmaddubsw": 430, "bsr": 431, "vpsllq": 432, "unpcklps": 433, "setle": 434, "fxch": 435, "pavgb": 436, " %ecx": 437, "movsq": 438, "fstpl": 439, "movw": 440, "vpackuswb": 441, "movlpd": 442, "sqrtsd": 443, "vpandn": 444, "vpsrldq": 445, "pmulld": 446, "vpsraw": 447, "rorx": 448, "pshuflw": 449, "vcvtsi2ss": 450, "vpmuludq": 451, "pminsw": 452, "vlddqu": 453, "fmul": 454, "%zmm17": 455, "divq": 456, "vpshufd": 457, "pinsrq": 458, "pcmpgtw": 459, "phaddd": 460, "pmulhrsw": 461, "psadbw": 462, "vpmulhrsw": 463, "vpunpcklbw": 464, "psubsw": 465, "setl": 466, "shrd": 467, "idivl": 468, "vpmulld": 469, "movsb": 470, "unpckhps": 471, "scas": 472, "sqrtss": 473, "repnz": 474, "vpbroadcastd": 475, "pcmpeqw": 476, "unpcklpd": 477, "orpd": 478, "vminsd": 479, "comisd": 480, "vcvttsd2si": 481, "%zmm18": 482, "subpd": 483, "cvtsi2sdq": 484, "vpunpckhqdq": 485, "paddb": 486, "aesenc": 487, "pabsw": 488, "andnpd": 489, "pcmpgtb": 490, "vpabsw": 491, "pmulhw": 492, "minss": 493, "vpsrlw": 494, "maxsd": 495, "psubusw": 496, "vpaddsw": 497, "vpinsrd": 498, "pavgw": 499, "cmpxchg": 500, "decl": 501, "comiss": 502, "vpunpckhbw": 503, "maxss": 504, "ud2": 505, "vpaddusw": 506, "%zmm19": 507, "movhlps": 508, "vcomiss": 509, "vsubpd": 510, "pcmpeqb": 511, "paddusw": 512, "movupd": 513, "pcmpeqd": 514, "aesdec": 515, "pslldq": 516, "vaddps": 517, "minsd": 518, "vmulps": 519, "%zmm20": 520, "%es:": 521, "cwtl": 522, "psubb": 523, "flds": 524, "vperm2i128": 525, "cvtsi2ssl": 526, "vperm2f128": 527, "vdivss": 528, "fld": 529, "tzcnt": 530, "%ds:": 531, "pmovzxbw": 532, "addw": 533, "paddusb": 534, "faddp": 535, "vmpsadbw": 536, "vpsubsw": 537, "cmpnlesd": 538, "movlhps": 539, "vpsubusb": 540, "setnp": 541, "vshufps": 542, "vsubps": 543, "palignr": 544, "vpinsrb": 545, "setp": 546, "vsqrtsd": 547, "setge": 548, "vpbroadcastw": 549, "vpalignr": 550, "kmovw": 551, "incl": 552, "pminsd": 553, "movsbw": 554, "pmaxsd": 555, "vandpd": 556, "pshufhw": 557, "vpsllw": 558, "vcvtsi2sdl": 559, "orw": 560, "pextrw": 561, "syscall": 562, "cpuid": 563, "vpsubq": 564, "psignw": 565, "vcvttss2si": 566, "divl": 567, "vpmaxsw": 568, "vcvtdq2pd": 569, "%zmm1": 570, "vfmadd213pd": 571, "vpminsw": 572, "pmovzxwd": 573, "vmovdqa32": 574, "cld": 575, "vpmovsxdq": 576, "faddl": 577, "%zmm0": 578, "vpavgb": 579, "packsswb": 580, "fldz": 581, "out": 582, "idivq": 583, "vpextrb": 584, "vpextrd": 585, "vpsadbw": 586, "vphaddd": 587, "fstl": 588, "fstps": 589, "fmulp": 590, "vshufpd": 591, "vpcmpeqw": 592, "vucomiss": 593, "vpmovsxwd": 594, "cvtpd2ps": 595, "movntdqa": 596, "movzbq": 597, "divpd": 598, "vandps": 599, "%zmm21": 600, "bndmov": 601, "pmulhuw": 602, "fldcw": 603, "vunpcklpd": 604, "%bnd2": 605, "adcx": 606, "movsl": 607, "phaddw": 608, "%zmm2": 609, "fld1": 610, "pshufw": 611, "vucomisd": 612, "vaesenc": 613, "%zmm24": 614, "vmaxsd": 615, "vpcmpgtw": 616, "vpsubusw": 617, "vmovhpd": 618, "mulx": 619, "vpinsrw": 620, "cvtdq2ps": 621, "vpmovzxwd": 622, "cvtps2pd": 623, "%zmm5": 624, "vpshuflw": 625, "orps": 626, "vmovddup": 627, "in": 628, "fsubl": 629, "%zmm3": 630, "pminub": 631, "vpsubb": 632, "pmovzxbd": 633, "emms": 634, "vmovhps": 635, "%zmm22": 636, "cvtdq2pd": 637, "vpavgw": 638, "subw": 639, "adox": 640, "vblendpd": 641, "%zmm23": 642, "pmaxub": 643, "%zmm9": 644, "vpextrw": 645, "andnps": 646, "%zmm4": 647, "andw": 648, "vfmadd213ps": 649, "unpckhpd": 650, "vpcmpgtb": 651, "vsqrtss": 652, "%zmm11": 653, "%zmm6": 654, "fmull": 655, "vcvtsi2ssl": 656, "vextracti32x8": 657, "shld": 658, "fadd": 659, "paddsb": 660, "vmaxss": 661, "sha256rnds2": 662, "fadds": 663, "prefetchnta": 664, "fsubrp": 665, "%zmm10": 666, "vpaddb": 667, "rorl": 668, "vpmovzxbd": 669, "sarl": 670, "cvtsi2ssq": 671, "andn": 672, "%ymm16": 673, "fnstsw": 674, "fsubp": 675, "vpblendd": 676, "%zmm7": 677, "movntq": 678, "vpackusdw": 679, "vpcmpeqb": 680, "fsub": 681, "%zmm13": 682, "fmuls": 683, "fchs": 684, "%zmm12": 685, "%zmm8": 686, "vpcmpeqd": 687, "vbroadcastss": 688, "vpabsd": 689, "vpslldq": 690, "%zmm14": 691, "cmpxchg16b": 692, "pabsd": 693, "fcomi": 694, "roll": 695, "vpaddusb": 696, "vpmulhw": 697, "vpsllvq": 698, "%gs": 699, "vbroadcasti128": 700, "fucomi": 701, "vminss": 702, "%xmm16": 703, "mpsadbw": 704, "fildl": 705, "%zmm15": 706, "int": 707, "vpxord": 708, "%zmm25": 709, "fildll": 710, "shlx": 711, "bts": 712, "%zmm26": 713, "vpmullw": 714, "fucomip": 715, "vpbroadcastq": 716, "pmovmskb": 717, "%zmm27": 718, "%zmm28": 719, "%zmm29": 720, "lddqu": 721, "sahf": 722, "psubq": 723, "jo": 724, "pinsrw": 725, "vinserti32x8": 726, "bndstx": 727, "%zmm30": 728, "bsf": 729, "lockcmpxchg": 730, "pextrd": 731, "cmpnless": 732, "%zmm31": 733, "cvtps2dq": 734, "aesenclast": 735, "minps": 736, "fcomip": 737, "%k7": 738, "%k4": 739, "%k5": 740, "%k6": 741, "vbroadcastsd": 742, "vcvtss2si": 743, "vpacksswb": 744, "vpermilpd": 745, "shrl": 746, "vpsrlvq": 747, "maxps": 748, "fsts": 749, "fnstcw": 750, "6": 751, "packusdw": 752, "vpmovsxbw": 753, "fdivp": 754, "psubsb": 755, "vdivpd": 756, "vpmovmskb": 757, "rolw": 758, "vpermd": 759, "prefetcht2": 760, "vunpcklps": 761, "shufpd": 762, "aesdeclast": 763, "vpcmpgtd": 764, "vpmovzxdq": 765, "incw": 766, "pmovzxdq": 767, "vaesdec": 768, "divps": 769, "stmxcsr": 770, "pause": 771, "shrq": 772, "vextractps": 773, "rdtsc": 774, "pavgusb": 775, "vpandq": 776, "vcvtsi2sdq": 777, "pmovsxwd": 778, "vpcmpeqq": 779, "vpsignw": 780, "cmpunordsd": 781, "aeskeygenassist": 782, "vpbroadcastb": 783, "vfnmadd231ps": 784, "notb": 785, "fdiv": 786, "outsl": 787, "fdivrp": 788, "pmovsxdq": 789, "cmpltsd": 790, "popcnt": 791, "vmovdqa64": 792, "vfnmadd231pd": 793, "vorpd": 794, "sha1rnds4": 795, "sha1nexte": 796, "vprold": 797, "vpmuldq": 798, "fistpl": 799, "vunpckhps": 800, "movmskps": 801, "vpmovqd": 802, "fsubr": 803, "vpmaxuw": 804, "vphminposuw": 805, "pblendw": 806, "vpgatherdd": 807, "fabs": 808, "notl": 809, "vpminub": 810, "bndldx": 811, "lret": 812, "aesimc": 813, "vpblendvb": 814, "fxam": 815, "movq2dq": 816, "bnd": 817, "vphaddw": 818, "insb": 819, "vandnpd": 820, "addr32": 821, "%bnd3": 822, "%k0": 823, "vpternlogq": 824, "%k1": 825, "vpaddsb": 826, "vcvttpd2dqy": 827, "vpclmullqlqdq": 828, "sha1msg1": 829, "sha1msg2": 830, "pextrb": 831, "vpmulhuw": 832, "%bnd0": 833, "cmpleps": 834, "fsubrl": 835, "vcvtdq2ps": 836, "pextrq": 837, "vcvtps2pd": 838, "vpmaxub": 839, "vpshufhw": 840, "sha256msg1": 841, "sha256msg2": 842, "bndcu": 843, "kxnorw": 844, "shlb": 845, "vpmadd52luq": 846, "vpmadd52huq": 847, "vprotd": 848, "pmuldq": 849, "movzwq": 850, "cmpltss": 851, "lods": 852, "%ymm17": 853, "%k3": 854, "bndcl": 855, "vgatherdpd": 856, "cmplesd": 857, "outsb": 858, "%ymm18": 859, "filds": 860, "cmpnltps": 861, "vpxorq": 862, "vmovhlps": 863, "%ymm19": 864, "vpandd": 865, "vpmaxsd": 866, "vunpckhpd": 867, "fistpll": 868, "ss": 869, "fcmovb": 870, "vmovlhps": 871, "vhaddpd": 872, "vmovlpd": 873, "fsqrt": 874, "insl": 875, "pabsb": 876, "cmpneqpd": 877, "pushfq": 878, "hlt": 879, "shlw": 880, "%ymm23": 881, "movntdq": 882, "fprem": 883, "fwait": 884, "fucom": 885, "lockxadd": 886, "fistl": 887, "vaesenclast": 888, "vshufi32x4": 889, "btr": 890, "%ymm20": 891, "%xmm17": 892, "pclmullqlqdq": 893, "vroundss": 894, "shrx": 895, "xgetbv": 896, "popfq": 897, "negq": 898, "int3": 899, "vpclmulhqhqdq": 900, "cvttps2dq": 901, "vptestmd": 902, "vmovdqu64": 903, "vcvtsd2si": 904, "fcmovnbe": 905, "%ymm22": 906, "vcvtpd2ps": 907, "fucompp": 908, "vptest": 909, "vroundsd": 910, "fdivr": 911, "sti": 912, "jno": 913, "vcvtps2dq": 914, "vcmpnltps": 915, "%ymm21": 916, "vpsignd": 917, "vpextrq": 918, "cmpnltsd": 919, "cmpsl": 920, "icebp": 921, "cmpltps": 922, "fldenv": 923, "cvtsd2si": 924, "shrb": 925, "sqrtps": 926, "vpandnq": 927, "vfmsub213pd": 928, "vgatherqpd": 929, "%k2": 930, "movmskpd": 931, "cli": 932, "fnstenv": 933, "rex": 934, "mull": 935, "rsqrtps": 936, "movddup": 937, "vfmadd231pd": 938, "xlat": 939, "vblendps": 940, "pminud": 941, "vprotq": 942, "vcmpltps": 943, "movdq2q": 944, "sarw": 945, "enterq": 946, "fsubrs": 947, "std": 948, "vpclmullqhqdq": 949, "vpblendw": 950, "vpabsb": 951, "shrw": 952, "vmovmskps": 953, "vpandnd": 954, "vpsubsb": 955, "adcl": 956, "mulb": 957, "vandnps": 958, "gs": 959, "vextracti32x4": 960, "%xmm20": 961, "pclmulhqhqdq": 962, "vfnmadd132pd": 963, "vfnmadd132ps": 964, "movzbw": 965, "rcpps": 966, "phminposuw": 967, "fdivl": 968, "stc": 969, "jrcxz": 970, "iret": 971, "%xmm21": 972, "lahf": 973, "vextracti64x4": 974, "pminuw": 975, "cmpless": 976, "cmc": 977, "%ymm28": 978, "vcmpnle_uqpd": 979, "vcvtpd2psy": 980, "fsubs": 981, "%ymm30": 982, "vorps": 983, "%ymm27": 984, "xabort": 985, "vpermilps": 986, "kmovq": 987, "clc": 988, "ds": 989, "%ymm25": 990, "%ymm26": 991, "pushf": 992, "vporq": 993, "cvtss2si": 994, "vbroadcastf128": 995, "%xmm24": 996, "vmaskmovpd": 997, "%cs:": 998, "psignd": 999, "ldmxcsr": 1000, "fucomp": 1001, "vfmadd231ps": 1002, "vpcmpneqb": 1003, "haddps": 1004, "cs": 1005, "vcvtsi2ssq": 1006, "fdivrl": 1007, "vfmadd132ps": 1008, "vpminsd": 1009, "fdivrs": 1010, "loope": 1011, "movbe": 1012, "vzeroall": 1013, "vcmpltsd": 1014, "pblendvb": 1015, "cmovp": 1016, "popf": 1017, "vcmpgt_oqpd": 1018, "vfmadd132pd": 1019, "vrndscalepd": 1020, "vfnmadd213pd": 1021, "vcmpnle_uqps": 1022, "vpternlogd": 1023, "vfnmadd213ps": 1024, "cmpordsd": 1025, "rolq": 1026, "cvttpd2dq": 1027, "vinserti32x4": 1028, "vminpd": 1029, "vmaxpd": 1030, "es": 1031, "loop": 1032, "vmovlps": 1033, "addsubps": 1034, "rcl": 1035, "%ymm24": 1036, "vpgatherqq": 1037, "sqrtpd": 1038, "negw": 1039, "vpcmpnltd": 1040, "fs": 1041, "pinsrd": 1042, "fdivs": 1043, "%cs": 1044, "sets": 1045, "vpminuw": 1046, "rsqrtss": 1047, "vcmplesd": 1048, "rolb": 1049, "pclmullqhqdq": 1050, "xrstor": 1051, "bndmk": 1052, "cmpnlepd": 1053, "vmovmskpd": 1054, "vptestmq": 1055, "vcmple_oqpd": 1056, "vcmpunordpd": 1057, "cmpltpd": 1058, "roundpd": 1059, "vcmpnlt_uqpd": 1060, "vpcmpltd": 1061, "vpermps": 1062, "vshuff32x4": 1063, "cmpordss": 1064, "vcmpltss": 1065, "%xmm18": 1066, "cmpneqps": 1067, "%xmm22": 1068, "rdrand": 1069, "vmaskmovps": 1070, "vpgatherdq": 1071, "imulb": 1072, "incb": 1073, "vdivps": 1074, "vcvttpd2dq": 1075, "negb": 1076, "vrsqrtss": 1077, "fisubl": 1078, "f": 1079, "xend": 1080, "vrcpps": 1081, "vroundpd": 1082, "vrcp28pd": 1083, "vrcp14pd": 1084, "cmpnleps": 1085, "vcmple_oqps": 1086, "cmpunordss": 1087, "cwtd": 1088, "cbtw": 1089, "pfmul": 1090, "lcall": 1091, "rclb": 1092, "vaesdeclast": 1093, "%ymm29": 1094, "fstenv": 1095, "p": 1096, "rorb": 1097, "vcmpneq_oqsd": 1098, "fcmove": 1099, "rorw": 1100, "pmovsxbw": 1101, "vcmpltpd": 1102, "%xmm23": 1103, "vbroadcasti64x2": 1104, "pmovsxbd": 1105, "%es": 1106, "fcomp": 1107, "fstcw": 1108, "phaddsw": 1109, "vpsignb": 1110, "vbroadcasti32x4": 1111, "%ymm31": 1112, "fiadds": 1113, "fimull": 1114, "decw": 1115, "cmovnp": 1116, "btc": 1117, "vphaddwq": 1118, "lretq": 1119, "maxpd": 1120, "xorw": 1121, "fcmovnu": 1122, "sarb": 1123, "fcmovnb": 1124, "vpclmulhqlqdq": 1125, "fsincos": 1126, "vpmovsxbd": 1127, "lzcnt": 1128, "phsubw": 1129, "adcb": 1130, "fnclex": 1131, "xtest": 1132, "%zmm2{%k1}{z}": 1133, "%zmm13{%k1}{z}": 1134, "vcmplt_oqpd": 1135, "%zmm12{%k1}{z}": 1136, "%zmm1{%k1}{z}": 1137, "{rn-sae}": 1138, "vpcmpled": 1139, "vpord": 1140, "vextractf32x8": 1141, "seto": 1142, "pminsb": 1143, "pclmulhqlqdq": 1144, "vphadddq": 1145, "fnsave": 1146, "vpcmpgtq": 1147, "femms": 1148, "gsjp": 1149, "rcr": 1150, "vphaddsw": 1151, "s": 1152, "rcrl": 1153, "vcmpnlesd": 1154, "vaddsubps": 1155, "divb": 1156, "pext": 1157, "fcomps": 1158, "fistps": 1159, "movsw": 1160, "fldl2e": 1161, "pf2id": 1162, "cvtps2pi": 1163, "%ss:": 1164, "fidivl": 1165, "ljmp": 1166, "fneni": 1167, "%k4}{z}": 1168, "rcll": 1169, "fiaddl": 1170, "sldt": 1171, "xsha1": 1172, "xsha256": 1173, "xcrypt-cbc": 1174, "xcrypt-cfb": 1175, "xcrypt-ofb": 1176, "notw": 1177, "cmpnltss": 1178, "lockor": 1179, "lockadd": 1180, "fscale": 1181, "vpperm": 1182, "%xmm19": 1183, "fcompl": 1184, "vinsertps": 1185, "%ds": 1186, "gsjb": 1187, "clflush": 1188, "cmpeqpd": 1189, "fldln2": 1190, "fcoms": 1191, "fisubrs": 1192, "decb": 1193, "for": 1194, "fcmovu": 1195, "phsubd": 1196, "pswapd": 1197, "fcoml": 1198, "ficomps": 1199, "vpmaxsb": 1200, "cmovno": 1201, "xsave": 1202, "%zmm6{%k1}{z}": 1203, "%zmm7{%k2}{z}": 1204, "%zmm5{%k1}{z}": 1205, "%zmm3{%k1}{z}": 1206, "%zmm1{%k2}{z}": 1207, "%zmm4{%k3}{z}": 1208, "%zmm13{%k3}{z}": 1209, "%zmm8{%k2}{z}": 1210, "%zmm7{%k1}{z}": 1211, "%zmm14{%k2}{z}": 1212, "%zmm11{%k3}{z}": 1213, "%zmm10{%k1}{z}": 1214, "vinsertf32x8": 1215, "fpatan": 1216, "psignb": 1217, "setns": 1218, "vshufi64x2": 1219, "outsw": 1220, "fsin": 1221, "vpminud": 1222, "vmovntdq": 1223, "cmpeqps": 1224, "idivb": 1225, "rcrb": 1226, "frstor": 1227, "vcmpnltsd": 1228, "fisttpl": 1229, "pusha": 1230, "popa": 1231, "cmplepd": 1232, "btsl": 1233, "vinserti64x4": 1234, "vextracti64x2": 1235, "block": 1236, "nsform": 1237, "frndint": 1238, "f2xm1": 1239, "lsl": 1240, "rdpid": 1241, "fidivs": 1242, "vmread": 1243, "lgs": 1244, "divw": 1245, "hsubps": 1246, "sbbb": 1247, "ficoms": 1248, "fisubrl": 1249, "ficoml": 1250, "fisttps": 1251, "%k5}": 1252, "fsja": 1253, "esjs": 1254, "fimuls": 1255, "vcmpunordsd": 1256, "vcmpnltss": 1257, "pfadd": 1258, "pfsub": 1259, "ljmpw": 1260, "fisttpll": 1261, "insertps": 1262, "abso": 1263, "rb": 1264, "pinsrb": 1265, "vcmpeq_ussd": 1266, "kmovd": 1267, "vmovdqu8": 1268, "vmovshdup": 1269, "kmovb": 1270, "bzhi": 1271, "%ymm16{%k7}{z}": 1272, "%ymm3{%k7}{z}": 1273, "%ymm4{%k7}{z}": 1274, "%ymm5{%k7}{z}": 1275, "%ymm5{%k1}{z}": 1276, "%ymm16{%k1}{z}": 1277, "%ymm3{%k1}{z}": 1278, "%ymm4{%k1}{z}": 1279, "%xmm28": 1280, "%xmm29": 1281, "pmaxuw": 1282, "vcmpneq_oqss": 1283, "vsqrtpd": 1284, "rcpss": 1285, "vcvttps2dq": 1286, "movshdup": 1287, "vcmpleps": 1288, "fcos": 1289, "minpd": 1290, "mburg": 1291, "fidivrs": 1292, "ficompl": 1293, "fbstp": 1294, "rdseed": 1295, "sarx": 1296}